---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotGroupCurtainGridHost
source: html/1f8a1286-40fe-e825-7656-c2f37810d949.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotGroupCurtainGridHost Property

Curtain grid based elements cannot be grouped.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGroupCurtainGridHost { get; }
```